Revit 2027 API
SpecTypeId.PipingVelocity Property
 Velocity, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingVelocity { get; }
Public Shared ReadOnly Property PipingVelocity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingVelocity {
	ForgeTypeId^ get ();
}
static member PipingVelocity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace